perf/async_sync_test_ramps.yaml
config:
  environments:
    bbox1:
      target: 'http://localhost:9090/bbox1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    bbox2:
      target: 'http://localhost:9091/bbox2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp - 1
      duration: 10
      arrivalRate: 1
      rampTo: 10
    - name: Plain - 1
      duration: 20
      arrivalRate: 10
    - name: Ramp - 2
      duration: 10
      arrivalRate: 10
      rampTo: 30
    - name: Plain - 2
      duration: 20
      arrivalRate: 30


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'