perf/basic_1_node.yaml
config:
  environments:
    async:
      target: 'http://localhost:5555/node/async-proxy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    sync:
      target: 'http://localhost:5555/node/sync-proxy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp - 1
      duration: 15
      arrivalRate: 5
      rampTo: 10
    - name: Plain - 1
      duration: 30
      arrivalRate: 10


    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'