perf/basic_1_node.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    async:
      target: 'http://localhost:5555/node/async-proxy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-async"
    sync:
      target: 'http://localhost:5555/node/sync-proxy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-sync"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 100


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'