perf/bbox_art.yaml
config:
  environments:
    bbox1:
      target: 'http://localhost:9090/bbox1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox1"

    bbox2:
      target: 'http://localhost:9091/bbox2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox2"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'