perf/scenario_heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 50
      arrivalRate: 3
      rampTo: 30
    - name: Plain
      duration: 150
      arrivalRate: 3
    - name: HEAVY
      arrivalRate: 1
      duration: 10
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/heavy'